app/views/comments/_comments.html.erb

	<% @post.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 2

		</p>
		<% if comment.comment_likes.size > 0 %>
---
SELECT COUNT(*) FROM `comment_likes` WHERE `comment_likes`.`comment_id` = 2

							:method => :delete %> |
			<% likes = comment.comment_likes.where(:user_id => current_user) %>
---
SELECT `comment_likes`.* FROM `comment_likes` WHERE `comment_likes`.`comment_id` = 3 AND `comment_likes`.`user_id` = 1 LIMIT 1