app/views/posts/mural.html.erb

SELECT COUNT(*) FROM `post_likes` WHERE `post_likes`.`post_id` = 1
SELECT `post_likes`.* FROM `post_likes` WHERE `post_likes`.`post_id` = 1 LIMIT 1
SELECT `posts`.* FROM `posts` ORDER BY created_at DESC
---
		</p>
		<% if post.post_likes.size > 0 %>

SELECT `post_likes`.* FROM `post_likes` WHERE `post_likes`.`post_id` = 1 AND `post_likes`.`user_id` = 2 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
			<p>
				<%= post.post_likes.first.user.username %>  likes this.
			</p>

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1
---
			<p style="font-weight: bold;">Comments</p>
			<% post.comments.each do |comment| %>

SELECT COUNT(*) FROM `comment_likes` WHERE `comment_likes`.`comment_id` = 3
SELECT `comment_likes`.* FROM `comment_likes` WHERE `comment_likes`.`comment_id` = 6 LIMIT 1
---
				</p>
				<% if comment.comment_likes.size > 0 %>

SELECT `comment_likes`.* FROM `comment_likes` WHERE `comment_likes`.`comment_id` = 6 AND `comment_likes`.`user_id` = 1 LIMIT 1
---
					<p>
						<%= comment.comment_likes.first.user.username %>  likes this.
					</p>