app/views/posts/show.html.erb

</p>
<% if @post.post_likes.size > 0 %>
---
SELECT COUNT(*) FROM `post_likes` WHERE `post_likes`.`post_id` = 1
SELECT `post_likes`.* FROM `post_likes` WHERE `post_likes`.`post_id` = 1 AND `post_likes`.`id` = 1 LIMIT 1

<%= link_to 'Destroy Post', @post, confirm: 'Are you sure?', method: :delete %> |
<% likes = @post.post_likes.where(:user_id => current_user) %>
---
SELECT `post_likes`.* FROM `post_likes` WHERE `post_likes`.`post_id` = 1 AND `post_likes`.`user_id` = 1