app/controllers/comment_likes_controller.rb

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 2 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `comment_likes` (`comment_id`, `created_at`, `updated_at`, `user_id`) VALUES (NULL, '2012-05-09 20:30:08', '2012-05-09 20:30:08', NULL)
---
	def create
		@comment = Comment.find(params[:comment_id])
		@user = User.find(current_user)
		@like = CommentLike.create(params[:comment_like])

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 3 LIMIT 1
SELECT `comment_likes`.* FROM `comment_likes` WHERE `comment_likes`.`comment_id` = 3 AND `comment_likes`.`id` = 3 LIMIT 1
DELETE FROM `comment_likes` WHERE `comment_likes`.`id` = 3
---
	def destroy
	  @comment = Comment.find(params[:comment_id])
	  @like = @comment.comment_likes.find(params[:id])
	  @like.destroy