app/controllers/comments_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
INSERT INTO `comments` (`body`, `created_at`, `post_id`, `updated_at`, `user_id`) VALUES ('Comentario 1.', '2012-05-08 00:54:43', NULL, '2012-05-08 00:54:43', NULL)
---
	def create
	  @post = Post.find(params[:post_id])
	  @user = User.find(session[:user_id])
	  @comment = Comment.create(params[:comment])

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1 AND `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    @comment.destroy