app/controllers/posts_controller.rb

  def index
  	@user = User.find(current_user)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def mural
  	# @user = User.find(current_user)
  	# TODO: pegar todos os posts de amigos
    @posts = Post.order(:created_at).reverse_order
---
SELECT `posts`.* FROM `posts` ORDER BY created_at DESC

  def show
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1

  def edit
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1

  def create
  	@user = User.find(current_user)
    # @post = Post.new(params[:post])
    @post = @user.posts.create(params[:post])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `posts` (`content`, `created_at`, `updated_at`, `user_id`) VALUES ('adasdasdas', '2012-05-07 21:43:28', '2012-05-07 21:43:28', 1)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `content` = 'Novo post 1 versão 2.', `updated_at` = '2012-05-08 00:26:22' WHERE `posts`.`id` = 2

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 2