app/controllers/post_likes_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@user = User.find(current_user)
		@like = PostLike.create(params[:post_like])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `post_likes` (`created_at`, `post_id`, `updated_at`, `user_id`) VALUES ('2012-05-09 19:38:51', NULL, '2012-05-09 19:38:51', NULL)

	def destroy
	  @post = Post.find(params[:post_id])
	  @like = @post.post_likes.find(params[:id])
	  @like.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
SELECT `post_likes`.* FROM `post_likes` WHERE `post_likes`.`post_id` = 1 AND `post_likes`.`id` = 23 LIMIT 1
DELETE FROM `post_likes` WHERE `post_likes`.`id` = 23